---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternallyTaggedNonBRep
source: html/a423713a-a3f1-a1af-b6b1-1c6196bc0c4c.htm
---
# ExternallyTaggedNonBRep Members

Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with
 a particular GeometryObject.